Revit 2027 API
ParameterTypeId.StructuralAssetParam Property
 "Physical Material Asset"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralAssetParam { get; }
Public Shared ReadOnly Property StructuralAssetParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralAssetParam {
	ForgeTypeId^ get ();
}
static member StructuralAssetParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace